## Staging: alarms 🚨
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 16 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                       NAME                                        |
|--------|-----------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_event_rule.glue_job_failure`                                      |
|        | `aws_cloudwatch_log_metric_filter.glue_crawler_error`                             |
|        | `aws_cloudwatch_log_metric_filter.glue_etl_error`                                 |
|        | `aws_cloudwatch_metric_alarm.glue_crawler_error`                                  |
|        | `aws_cloudwatch_metric_alarm.glue_etl_error`                                      |
|        | `aws_cloudwatch_metric_alarm.glue_job_failures`                                   |
|        | `aws_cloudwatch_metric_alarm.platform_gc_forms_etl_user_processed_record_anomaly` |
|        | `aws_cloudwatch_query_definition.glue_crawler_errors`                             |
|        | `aws_kms_alias.cloudwatch`                                                        |
|        | `aws_kms_key.cloudwatch`                                                          |
|        | `aws_sns_topic.cloudwatch_alarm_action`                                           |
|        | `aws_sns_topic.cloudwatch_ok_action`                                              |
|        | `aws_sns_topic_policy.cloudwatch_alarm_action`                                    |
|        | `aws_sns_topic_policy.cloudwatch_ok_action`                                       |
|        | `aws_sns_topic_subscription.cloudwatch_alarm_action`                              |
|        | `aws_sns_topic_subscription.cloudwatch_ok_action`                                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.glue_job_failure will be created
  + resource "aws_cloudwatch_event_rule" "glue_job_failure" {
      + arn            = (known after apply)
      + description    = "Capture Glue job failures and timeouts"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + state = [
                      + "FAILED",
                      + "TIMEOUT",
                      + "ERROR",
                    ]
                }
              + detail-type = [
                  + "Glue Job State Change",
                ]
              + source      = [
                  + "aws.glue",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "glue-job-failures"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_metric_filter.glue_crawler_error will be created
  + resource "aws_cloudwatch_log_metric_filter" "glue_crawler_error" {
      + id             = (known after apply)
      + log_group_name = "mock-glue-crawler-log-group"
      + name           = "glue-crawler-error"
      + pattern        = "ERROR"

      + metric_transformation {
          + default_value = "0"
          + name          = "glue-crawler-error"
          + namespace     = "data-lake"
          + unit          = "Count"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.glue_etl_error will be created
  + resource "aws_cloudwatch_log_metric_filter" "glue_etl_error" {
      + id             = (known after apply)
      + log_group_name = "mock-glue-etl-log-group/output"
      + name           = "glue-etl-error"
      + pattern        = "ERROR"

      + metric_transformation {
          + default_value = "0"
          + name          = "glue-etl-error"
          + namespace     = "data-lake"
          + unit          = "Count"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.glue_crawler_error will be created
  + resource "aws_cloudwatch_metric_alarm" "glue_crawler_error" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Errors logged over 1 minute by the Glue Crawler."
      + alarm_name                            = "glue-crawler-error"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "glue-crawler-error"
      + namespace                             = "data-lake"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.glue_etl_error will be created
  + resource "aws_cloudwatch_metric_alarm" "glue_etl_error" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Errors logged over 1 minute by a Glue ETL job."
      + alarm_name                            = "glue-etl-error"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "glue-etl-error"
      + namespace                             = "data-lake"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.glue_job_failures will be created
  + resource "aws_cloudwatch_metric_alarm" "glue_job_failures" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Glue Job state has changed to `Failure`, `Timeout` or `Error`."
      + alarm_name                            = "glue-job-failures"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "RuleName" = "glue-job-failures"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "MatchedEvents"
      + namespace                             = "AWS/Events"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.platform_gc_forms_etl_user_processed_record_anomaly will be created
  + resource "aws_cloudwatch_metric_alarm" "platform_gc_forms_etl_user_processed_record_anomaly" {
      + actions_enabled                       = true
      + alarm_description                     = "'Platform / GC Forms' ETL job anomaly detection for the 'user' dataset."
      + alarm_name                            = "platform-gc-forms-etl-user-processed-record-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanLowerOrGreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold_metric_id                   = "processed_records_expected"
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "processed_records"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "Dataset" = "processed-data/user"
                }
              + metric_name = "ProcessedRecordCount"
              + namespace   = "data-lake/etl/gc-forms"
              + period      = 86400
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(processed_records, 0.5)"
          + id          = "processed_records_expected"
          + label       = "Processed Records (Expected)"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_query_definition.glue_crawler_errors will be created
  + resource "aws_cloudwatch_query_definition" "glue_crawler_errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "mock-glue-crawler-log-group",
        ]
      + name                = "Glue Crawler - ERRORS"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /ERROR/
            | sort @timestamp desc
            | limit 100
        EOT
    }

  # aws_kms_alias.cloudwatch will be created
  + resource "aws_kms_alias" "cloudwatch" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/sns-cloudwatch-alarms"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.cloudwatch will be created
  + resource "aws_kms_key" "cloudwatch" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "SNS topic for CloudWatch alarm actions"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::454671348950:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ca-central-1.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow_CloudWatch_for_CMK"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "CloudwatchEvents"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic.cloudwatch_alarm_action will be created
  + resource "aws_sns_topic" "cloudwatch_alarm_action" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "cloudwatch-alarm-action"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic.cloudwatch_ok_action will be created
  + resource "aws_sns_topic" "cloudwatch_ok_action" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "cloudwatch-ok-action"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_policy.cloudwatch_alarm_action will be created
  + resource "aws_sns_topic_policy" "cloudwatch_alarm_action" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:Subscribe",
                          + "SNS:SetTopicAttributes",
                          + "SNS:RemovePermission",
                          + "SNS:Receive",
                          + "SNS:Publish",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:GetTopicAttributes",
                          + "SNS:DeleteTopic",
                          + "SNS:AddPermission",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "454671348950"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Default_Policy"
                    },
                  + {
                      + Action    = "sns:Publish"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Publish_statement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_sns_topic_policy.cloudwatch_ok_action will be created
  + resource "aws_sns_topic_policy" "cloudwatch_ok_action" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:Subscribe",
                          + "SNS:SetTopicAttributes",
                          + "SNS:RemovePermission",
                          + "SNS:Receive",
                          + "SNS:Publish",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:GetTopicAttributes",
                          + "SNS:DeleteTopic",
                          + "SNS:AddPermission",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "454671348950"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Default_Policy"
                    },
                  + {
                      + Action    = "sns:Publish"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Publish_statement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_sns_topic_subscription.cloudwatch_alarm_action will be created
  + resource "aws_sns_topic_subscription" "cloudwatch_alarm_action" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive value)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.cloudwatch_ok_action will be created
  + resource "aws_sns_topic_subscription" "cloudwatch_ok_action" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive value)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sns_topic_alarm_action_arn = (known after apply)
  + sns_topic_ok_action_arn    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.glue_job_failure"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_crawler_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_etl_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_job_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.platform_gc_forms_etl_user_processed_record_anomaly"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_alarm_action"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_ok_action"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
